<template>
  <div class="rigist_block">
    <form class="form regist" action="" @submit.prevent="regist" novalidate v-show="!show">
      <h2>欢迎注册算力网</h2>
      <FormField :form="form"></FormField>
      <label for="accept">
        <input type="checkbox" id="accept" name="accept">
        <span>阅读并接受<a href="javascript:;" @click="userAgreement" style="color:#327fff;">《用户使用协议》</a></span>
        <span class="select_accept">请选择</span>
      </label>
      <button name="btn">注册</button>
    </form>
    <mt-popup position="bottom" v-model="show" :closeOnClickModal="false">
      <div class="close" @click="closeEdit()">
        <span class="icon"></span>
      </div>
      <div class="agreement">
        <h2>“算力网”用户使用协议</h2>
        <div class="box_content">
          <h3>重要提示：</h3>
          <p>浙江数秦科技有限公司（以下简称“本公司”）通过旗下运营管理的算力网(www.suanli.com)（以下简称“本网站”）依据本协议的规定向本公司的用户（以下简称“您或用户”）提供与比特币、区块链有关的信息咨询与管理服务。本协议在您和本公司之间具有合同法上的法律效力。为保障您的合法权益，请您在通过本网站注册成为网站用户时，务必仔细阅读以下条款并完全理解本协议的全部内容，特别是其中所涉及的免除及限制本公司责任的条款，对用户权利限制的条款。请您审慎阅读并选择接受或不接受本协议。</p>
          <p>若您一旦注册，即视为您已不加修改地无条件完全接受本协议所包含的内容和本公司通过本网站已经发布的或将来可能发布的各类规则。各类规则为协议不可分割的一部分，与本协议具有同等法律效力。本协议是由您与本公司共同签订的，适用于您在本网站的全部行为。如您不接受本协议的任一条款，请您立即停止注册或主动停止使用本公司的服务。</p>
          <p>本公司有权根据法律的规定及业务发展的需要不时地制定、修改本协议或各类规则，如本协议及规则有任何变更，一切变更以本网站最新公布的为准。经修订的协议、规则一经在本网站公布，即自动生效或在该等协议、规则指定的时间生效。您应不时地注意本协议及附属规则地变更，若您不同意相关变更，本公司有权不经任何告知终止、中止本协议或限制您使用本网站的全部或部分功能且不承担任何法律责任，或您主动停止使用本网站的服务。但该终止、中止或限制行为并不能豁免您通过本网站已经进行的交易下所应承担的义务。本协议的约定不涉及您与本网站的其他用户之间因网上交易而产生的法律关系及法律纠纷。</p>
          <h4>本协议包括以下内容：</h4>
          <p>第一条 用户注册</p>
          <p>第二条 用户须知</p>
          <p>第三条 用户的陈述及保证</p>
          <p>第四条 服务内容和费用的收取</p>
          <p>第五条 通知</p>
          <p>第六条 用户信息的维护及使用</p>
          <p>第七条 用户注销或限制访问、服务协议的中止或终止</p>
          <p>第八条 免责声明</p>
          <p>第九条 知识产权保护</p>
          <p>第十条 保密协定</p>
          <p>第十一条 赔偿责任</p>
          <p>第十二条 使用法律和管辖</p>
          <p>第十三条 税收</p>
          <p>第十四条 继承或赠与</p>
          <p>第十五条 投诉与咨询</p>
          <p>第十六条 其他</p>
          <p class="b">第一条 用户注册</p>
          <p>1.1 您通过PC端登陆“算力网”网站进入注册程序。</p>
          <p>1.2 点击确认“我已经阅读并且同意”浙江数秦科技有限公司网站注册服务协议前的方框。</p>
          <p>1.3 按照本网站发布的规定填写注册用户账户，手机号码及密码等信息，通过手机验证，确认后即成为本公司的用户。</p>
          <p>1.4 根据《中华人民共和国合同法》等相关法律、法规，如您通过进入注册程序并按照本网站规定的注册程序成功注册为用户，即表示您已经同意并签署本协议，自愿接受本协议；此后，您不得以未阅读本协议内容作任何形式的抗辩，也不得以未签署书面协议为由否认本协议的效力。</p>
          <p class="b">第二条 用户须知</p>
          <p>2.1 本网站的用户分为自然人用户和企业用户，本公司仅接受符合以下任一条件的自然人或企业法人成为本网站用户：</p>
          <p>（1）持有中国大陆有效身份证件的18周岁以上的具有完全民事行为能力的自然人；</p>
          <p>（2）在中国大陆合法注册的企业法人。</p>
          <p>2.2 未成年人（年龄18周岁以下人士）、限制行为能力人、中国（包括港澳台地区）以外地区自然人及企业法人无资格注册成为本网站用户，本网站要求未成年人、限制行为能力人、中国（包括港澳台地区）以外地区的自然人及企业法人不要向本网站提交任何注册资料。</p>
          <p>如您不符合资格，请勿注册，否则本公司保留随时中止或终止您用户资格的权利。您在此向本公司保证，您已符合上述关于年龄和国籍的条件，如因您通过本网站提供虚假信息或承诺而导致本公司蒙受任何损失，您将承担全部责任并赔偿相关损失。</p>
          <p>2.3 您注册成功后，不得将本网站的用户账户转让给第三方使用。您确认，您使用在本网站注册和设置的用户账户和密码登录本网站后在本网站的一切行为均代表您自身做出的行为并由您承担相应的法律后果。任何利用您的用户账户及密码登陆本网站并从事咨询、交易等行为均将被视为您的行为。因此，您有义务谨慎妥善的保管您的用户账户及密码。本公司对您的用户账户和密码的遗失或被盗取所产生的后果不承担任何责任。</p>
          <p>2.4 在本网站交易需订立的合同均采用电子合同方式。用户使用用户账户登录本网站后，以用户账户在本网站通过点击确认或类似方式签署的电子合同即视为用户真实意愿并以用户本人名义签署的合同，具有法律效力。用户应妥善保管自己的账户密码等账户信息，通过前述方式订立的电子合同对合同各方具有法律约束力，用户不得以其账户密码等账户信息被盗用或其他理由否认已订立的合同的效力或不按照该等合同履行相关义务。</p>
          <p>2.5 您有义务在注册时提供真实资料，并保证诸如电子邮件地址、联系电话、联系地址等内容的有效性及安全性。如您因网上交易与其他用户产生诉讼的，其他用户有权通过司法部门要求本公司提供相关资料。</p>
          <p>2.6 您如变更账户信息、通讯地址、电话等相关重要信息，须及时通过本网将通知本公司。因您未及时通知而导致自身受到的一切损失，由您自行承担责任。</p>
          <p class="b">第三条 用户陈述与保证</p>
          <p>3.1 本网站用户应保证严格遵守中国现行法律、法规、政府规章及其他应该遵守的规范性文件，不通过本网站从事危害国家安全、洗钱、套现、传销等任何违法活动或其他有违社会公共利益或公共道德的行为。</p>
          <p>3.2 您确认在签署本协议前已阅读包括但不限于以下与本协议及相关协议的订立及履行有关的风险提示，包括政策风险、信用风险、不可抗力风险等，并对该等风险有充分理解和预期，您自愿承担该等风险可能给带来的一切责任和损失和责任。</p>
          <p>3.3 您承诺合法使用本网站提供的服务及网站内容。禁止通过本网站从事任何可能违反中华人民共和国现行法律、法规、规章和政府规范性文件的行为，禁止任何未经授权使用本网站的行为，如擅自进入本网站的未公开的系统、不正当的使用密码和网站的任何内容、窃取他人的账号和密码、窃取他人的个人隐私信息等。</p>
          <p>3.4 您承诺将依据本协议和本网张发布的规则查阅、保存和使用电子合同，不得擅自修改电子合同，不得私自仿制、伪造签订的电子合同或印章，不得用伪造的合同进行招摇撞骗或进行其他非法使用，否则由您自行承担责任。</p>
          <p>3.5 您承诺您在本网站发布的内容拥有合法权利。您在本网站发布的内容不侵犯任何第三人的肖像权、隐私权、著作权、商标权、专利权或者其它合法权利。否则因此给本公司或任何第三方造成的一切损失均由您自行承当赔偿责任。</p>
          <p>3.6 您承诺未经本公司同意，将不得对本网站的任何部分或全部以及通过本网站取得的任何形式的信息，进行复制、拷贝、出售、转售或用于任何其它商业目的。</p>
          <p class="b">第四条 服务内容及费用收取</p>
          <p>4.1 本网站的用户分为产品（包括但不限于矿机设备，算力服务和矿机设备托管服务，比特币等虚拟商品）的销售方和购买方两种，本公司通过本网站提供产品的信息咨询与管理服务，其中本公司通过PC端的“算力网”网站向用户（包括销售方和购买方）提供以下核心服务：</p>
          <p>（1）产品信息发布</p>
          <p>本公司接受销售方用户的委托在“算力网”网站上发布产品信息，包括但不限于销售方主体情况、产品介绍、产品评论等信息。销售方在本网站上发布产品信息的，应先通过本公司的尽职调查、审核等风险控制措施后方可在本网站上发布。
          购买方用户通过本网站购买产品后，可以作为销售方在本网站上将购买的产品再次对外转让。</p>
          <p>（2）产品信息咨询服务</p>
          <p>购买方用户可以在本网站上浏览公告、产品介绍、产品评论等网站开放信息，同时还可以依据本网站提供的服务和相关规则参与自己感兴趣的产品的探讨、询价及产品等事宜。</p>
          <p>（3）交易管理服务</p> 
          <p>本公司为销售方用户与购买方用户之间提供电子合同的签署和鉴证服务，产品款项的代收付服务，产品后续管理服务等交易管理服务。</p>
          <p>（4）合同管理服务</p>
          <p>本公司通过本网站向用户提供电子合同的备案、查看、核对服务。</p>
          <p>（5）其他相关服务</p>
          <p>4.2 您可以根据实际需要通过本公司的PC端的“算力网”网站获得您需要的服务。本公司可以暂时停止、限制或改变本公司通过本网站提供的部分服务内容，或提供新的服务内容。</p>
          <p>4.3 用户在接受本网站各项服务的同时，同意自动接受本公司提供的各类信息服务。用户在此授权本公司可以向其电子邮件、手机等发送商业信息。用户有权选择不接受本公司提供的各类信息服务，用户应自行通过本网站的相关页面进行更改。</p>
          <p>4.4 本公司就向您提供的服务是否收取服务费及具体标准和规则由本公司与您另行签署其他协议，或以本网站公布的规则确定。</p>
          <p>4.5 用户在下载或浏览本网站时，必须自行准备相关设备并承担如下开支：</p> 
          <p>（1）包括并不限于手机等上网装置购置费；</p> 
          <p>（2）包括并不限于手机流量费等上网费用。</p>
          <p>4.6 为防止他人冒用您的身份注册、使用本公司的服务，本公司可能会给您的手机发送短信进行验证，由此产生的短信费用由本公司支付，用户不需支付任何费用。</p>
          <p class="b">第五条 通知</p>
          <p>5.1 本协议项下的通知以公示方式作出，一经在本网站公示即视为已经送达。除此，其他向您个人发布的具有专属性的通知，本公司向您在注册时提供的电子邮箱，或在您的个人账户中为您设置的站内消息系统栏，或您在注册时提供的手机发送，一经发送即视为已经送达。您须密切关注您的电子邮箱 、站内消息系统栏中的邮件、信息及手机中的短信。</p>
          <p>5.2 您同意本公司出于向您提供服务之目的，可以向您的电子邮箱、站内消息系统栏和手机发送有关通知或提醒。若您设置不接收有关通知或提醒，则您有可能无法接受该等通知信息，您不得以您未收到或未阅读该等通知信息主张相关通知未送达于您。</p>
          <p class="b">第六条 用户信息的维护与使用</p>
          <p>6.1 本公司收集和储存您的用户信息的目的在于提高为您提供服务的效率和质量。本公司收集个人资料的主要目的在于向您提供一个顺利、有效和度身订造的服务经历。本公司会通过以下方式收集或获取您的资料：</p>
          <p>（1）自公开及私人资料来源收集关于您的额外资料；</p>
          <p>（2）按照您在本网站网址上的行为自动追踪关于您的某些资料；</p>
          <p>（3）如果您将个人通讯信息（例如：手机短信、电邮或信件）交付给本公司，或如果其他用户或第三方向本公司发出关于您在本网站上的活动或登录事项的通讯信息，本公司可以将这些资料收集在您的专门档案中；</p>
          <p>（4）其他合理的资料收集或获取方式。</p>
          <p>6.2 您同意本公司在业务运营中使用您的用户信息，包括但不限于：</p>
          <p>（1）进行用户身份、信息核实；</p>
          <p>（2）出于提供服务的需要在本网站公示您的相关信息；</p>
          <p>（3）向本公司的合作机构（该合作机构仅限于本公司为了完成拟向您提供的服务而合作的机构）提供您的用户信息；</p>
          <p>（4）由人工或自动程序对您信息进行评估、分类、研究；</p>
          <p>（5）使用您的用户信息以改进本网站的推广；</p>
          <p>（6）使用您提供的联系方式与您联络并向您传递有关业务和管理方面的信息，向您传递针对您的兴趣而提供的信息；</p>
          <p>（7）用于配合有权机关依职权调取证据材料；</p>
          <p>（8）解决争议、调停纠纷、确保通过本网站的交易安全；</p>
          <p>（9）执行本公司与用户之间签署的其他协议。</p>
          <p>6.3 您可以授权本公司帮助您修改您在本网站填写的一切个人资料。如您违反本协议及相关规则，本网站有权经电子邮件告知后在网站数据库中删除您的个人资料。网站有权根据实际审核结果在不通知您的情况下对您所填写的与事实不符的资料进行修正或更改。</p>
          <p>6.4 您须对使用您的用户账户和密码所采取的一切行为负责。因此，本公司建议您不要向任何第三方披露您在本网站的用户账户和密码。</p>
          <p>6.5 您不得使用本公司提供的服务或其他电子邮件转发服务发送垃圾邮件或其他可能影响本网站系统运行或违反协议的内容。 如果您利用本公司的服务向没有在本网站内注册的电子邮件地址发出电子邮件,本公司除了利用该电子邮件地址发出您的电子邮件之外将不作任何其他用途。本公司不会出租或出售这些电子邮件地址。本公司不会永久储存电子邮件信息或电子邮件地址。</p>
          <p class="b">第七条 账户注销或限制访问、服务协议的中止或终止</p>
          <p>7.1 若您决定不再使用本公司服务，应清偿所有应付款项（包括但不限于服务费、违约金、管理费等），在满足本公司提现规则的前提下将您的用户账户下所对应的可用款项（如有）全部提现，并通过本网站申请注销您的账户，经本公司审核同意后可正式注销您的账户。</p>
          <p>7.2 若发生以下任一情况的，本公司有权通过电子邮件等方式告知方式终止本协议、关闭您的账户或限制您使用本网站：</p>
          <p>（1）您提供的资料不准确、不真实、不合法有效，违反了本协议及相关规则的约定；</p>
          <p>（2）您长时间（注册后连续超过12个月）未能使用其账号的；</p>
          <p>（3）您在本网站的行为违反本协议及相关规则的约定或相关法律法规的规定；</p>
          <p>（4）依据政府机构、司法机构等要求，需要终止本协议、关闭您的账户或限制您使用本网站的。</p>
          <p>7.3 如因本公司或第三方支付机构、银行等任何第三方的原因导致系统维护或升级、对于网络设备进行必要的保养及施工、出现突发性的网络设备故障时而需暂停服务的，本公司将尽可能事先进行通告并减少给您带来的不便。</p>
          <p>7.4 发生以下事宜后，用户使用本网站服务的权利立即终止：</p>
          <p>（1）用户注销用户账户；</p>
          <p>（2）本公司终止本协议或关闭您的账户。</p>
          <p>从终止用户使用本网站服务的权利时起，本公司不再对用户承担任何责任和义务。服务终止后，本公司没有义务为您保留原账号中或与之相关的任何信息，或转发任何未曾阅读或发送的信息给您或第三方，本公司可将您在本网站中留存的任何内容加以移除或删除。此外，本公司亦不会就终止用户账户使用而对您或任何第三者承担任何责任。</p>
          <p>7.5 用户账户的注销、协议的终止等不代表用户责任的终止，用户仍应对其使用本公司提供服务期间的行为承担可能的违约或损害赔偿责任。</p>
          <p class="b">第八条 免责声明</p>
          <p>8.1 除非另有书面协议约定，本公司在任何情况下，对用户使用本网站服务而产生的任何形式的直接或间接损失均不承担法律责任，包括但不限于资金损失、收益损失、营业中断损失等。</p>
          <p>8.2 本网站的内容可能涉及由第三方所有、控制或运营的其他网站的内容或链接（下称“第三方网站”）。对于该等内容或链接，您确认按照第三方网站的使用协议确定相关权利义务，第三方网站的内容、产品、广告和其他任何信息均由您自行判断并承担风险，与本公司无关。</p>
          <p>8.3 因不可抗力或本网站服务器死机、网络故障、数据库故障、软件升级等问题造成的服务中断和对用户个人数据及资料造成的损失，本公司不承担任何责任，亦不予赔偿，但将尽可能减少因此而给用户造成的损失和影响。</p>
          <p>8.4 因黑客、病毒或密码被盗、泄露等非本公司原因所造成损失概由您本人自行承担。</p>
          <p>8.5 您对您本人在使用本网站所提供的服务时的一切行为、行动（不论是否故意）负全部责任。</p>
          <p class="b">第九条 知识产权保护</p>
          <p>本网站中的全部内容的著作权、版权及其他知识产权均属于本公司所有，该等内容包括但不限于文本、数据、文章、设计、源代码、软件、图片、照片及其他全部信息（以下称“网站内容”）。网站内容受中华人民共和国著作权法及各国际版权公约的保护。未经本公司事先书面同意，您保证并承诺不以任何方式、不以任何形式复制、模仿、传播、出版、公布、展示网站内容，包括但不限于电子的、机械的、复印的、录音录像的方式和形式等。您承认网站内容是属于本公司的财产。未经本公司书面同意，您亦不得将本网站包含的资料等任何内容镜像到任何其他网站或服务器。任何未经授权对网站内容的使用均属于违法行为，本公司将追究您的法律责任。</p>
          <p class="b">第十条 保密协定</p>
          <p>10.1 用户在接受本公司提供服务的过程中了解到的所有信息，包括但不限于本网站信息资料、业务运营情况、商业秘密等，不得向任何第三人披露。</p>
          <p>10.2 除本协议另有约定外，本公司必须根据中国法律的规定对本网站用户个人信息、资产情况和相关资料予以保密。本公司采用行业标准惯例以保护您的个人资料，但鉴于技术限制，本公司不能确保您的全部私人通讯及其他个人资料不会通过本协议中未列明的途径泄露出去，对此本公司不承担任何责任。</p>
          <p>10.3 本公司有权根据有关法律和监管要求，本公司风险控制要求以及相关协议要求向司法机关等政府部门、社会组织或团体、其他第三方服务或合作机构提供您的个人资料。</p>
          <p>10.4 在您未能按照以下协议的约定履行自己应尽的义务时：</p>
          <p>（1）与本公司签订的服务协议、居间协议、产品咨询与服务管理协议等；</p>
          <p>（2）通过本网站提供的交易活动而与其他方签署的《矿机购买力协议》、《算力购买协议》等。</p>
          <p>本公司有权根据自己的判断或者与协议有关的第三方的请求披露您的个人资料，并做出评论。</p>
          <p>10.5 在本网站提供的交易活动中，您无权要求本公司提供其他用户的个人资料，除非符合以下条件：</p>
          <p>（1）您已向法院起诉其他用户的在本网站活动中的违约行为；</p>
          <p>（2）本公司被吊销营业执照、解散、清算、宣告破产或者其他有碍于您收回产品的情形。</p>
          <p class="b">第十一条 赔偿责任</p>
          <p>11.1 如您的行为使本公司及/或其关联公司遭受损失（包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），您应赔偿本公司及/或其关联公司的上述全部损失。</p>
          <p>11.2 如您的行为使本公司及/或其关联公司遭受第三人主张权利，用户承诺无条件承担相应责任并使本公司免责。若因此给本公司造成损失的，应予赔偿，赔偿范围包括但不限于本网站的维权费、商誉损失以及本公司向第三方支付的补偿金等。</p>
          <p class="b">第十二条 适用法律和管辖</p>
          <p>因本公司提供服务所产生的争议均适用中华人民共和国法律，并由杭州乐筹金融信息服务有限公司住所地的人民法院管辖。</p>
          <p class="b">第十三条  关于税费</p>
          <p>用户在产品的买卖、收益过程产生的相关税收缴纳义务，请根据中国法律的规定自行向其主管税务机关申报、缴纳，本网站不承担任何代扣代缴的义务及责任。</p>
          <p class="b">第十四条 继承或赠与</p>
          <p>如本公司用户出现资产的继承或赠与，必须由主张权利的继承人或受赠人向本公司出示经公证机关公证的继承或赠与权利归属证明文件，经本公司确认后方可予以协助办理资产权属变更手续，由此产生的各项费用等，由主张权利的继承人或受赠人向其主管税务机关申报、缴纳，本网站不负责相关事宜处理。</p>
          <p class="b">第十五条 投诉和咨询</p>
          <p>若您在使用本网站的过程中有任何的疑问、投诉和咨询，请先在客服作息时间拨打热线或发送电子邮件到本网站指定的电子邮箱：V@suanli.com。</p>
          <p class="b">第十六条 其他</p>
          <p>16.1 本公司对本服务协议拥有最终的解释权。</p>
          <p>16.2 本网站的某些部分或页面中、或您使用本公司相关服务产品的过程中，存在除本协议以外的服务条款或协议，若与本协议存在不一致的，则本协议以外的服务条款或协议将优先适用。</p>
          <p>16.3 本协议中的任何条款或部分条款因被认定为无效或无法实施的，不影响本协议其他条款的效力。</p>
          <p>16.4 您确认并同意本公司有权不时地根据法律、法规、政府要求透露、修改、屏蔽或删除必要的、合适的信息，以便更好地运营本网站并保护本公司用户的合法权益。</p>
          <p class="foot">浙江数秦科技有限公司</p>
          <div class="btn"><a href="javascript:;" @click="userAgreement">返回</a></div> 
        </div>
      </div>
    </mt-popup>
  </div>
</template>

<script>
  import { Toast } from 'mint-ui'
  import util from '@/util/index'
  import api from '@/util/function'
  import FormField from '@/components/common/FormField'
  export default {
    name: 'regist',
    components: {
      FormField
    },
    data () {
      return {
        form: [{name: 'mobile', type: 'text', title: '手机号码', placeholder: '请输入手机号', pattern: 'tel'}, {name: 'imgCode', type: 'text', title: '图形验证', placeholder: '请输入图形验证码', addon: 1, pattern: 'imgCode'}, {name: 'code', type: 'text', title: '短信验证', placeholder: '请输入短信验证码', addon: 2, pattern: 'telCode'}, {name: 'password', type: 'password', title: '设置密码', placeholder: '请输入密码', pattern: 'password'}, {name: 'password1', type: 'password', title: '确认密码', placeholder: '请再次输入密码', pattern: 'password', error: '两次密码不一致'}],
        show: false
      }
    },
    methods: {
      regist () {
        var form = document.querySelector('.regist')
        var data = api.checkFrom(form, this, api.checkEquipment())
        if (!data) return false
        if (!form.accept.checked) {
          form.accept.setAttribute('data-status', 'invalid')
          return false
        }
        form.btn.setAttribute('disabled', true)
        var self = this
        util.post('/register', {sign: api.serialize(Object.assign(data, {token: 0}))}).then(res => {
          api.checkAjax(self, res, () => {
            api.tips('恭喜您注册成功！', () => {
              self.$router.push({name: 'login'})
            })
          }, form.btn)
        })
      },
      userAgreement () {
        this.$parent.agree = !this.$parent.agree
        this.show = !this.show
      },
      myToast (str) {
        Toast({
          message: str,
          position: 'middle',
          duration: 3000
        })
      },
      closeEdit () {
        this.show = false
      }
    }
  }
</script>

<style type="text/css" lang="scss">
  @import '../../assets/css/style.scss';
  .rigist_block{
    width:420px;
    margin:0 auto;
    padding-top:35px;
    form.regist{
      @include form;
      h2{
        margin-top:0;
        @include mobile_hide
      }
      .select_accept{
        color:$red;
        font-size: 12px;
      }
      input{
        & ~ span.select_accept{
          display: none;
        }
        &[data-status='invalid'] ~ span.select_accept{
          display: inline;
        }
      }
    }
    .mint-popup{
      background: #fff;
      @include popup
      width:60vw;
      height:90vh;
      .agreement{
        height:calc(90vh - 30px);
        h2{
          text-align: center;
        }
        .box_content{
          p{
            text-indent: 0.2rem;
          }
          .foot{
            font-size: 16px;
          }
          .btn{
            text-align: center;
            margin-top:15px;
            a{
              padding:5px 30px;
              @include button($blue)
              font-size: 16px;
              border-radius:5px
            }
          }
        }
      }
    }
    @media screen and (max-width: $mobile) {
      width:100%;
      padding:30px 15px;
      background: #fff;
      .mint-popup{
        width:100vw;
        height:80vh;
        .agreement{
          height:calc(80vh - 30px);
          .box_content{
            font-size: 0.5rem;
            .foot{
              font-size: 0.5rem;
            }
            .btn a{
              font-size: 0.6rem;
            }
          }
        }
      }
    }
  }
</style>
